src/Catalogs/JIRA_ТипыСвязейЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>JIRA_ТипыСвязейЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Внутри</Name>
					<Comment>inward</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снаружи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/JIRA_ТипыСвязейЗадач/Ext/ManagerModule.bsl
Функция НайтиСоздатьТипСвязиЗадач(Данные) Экспорт
	
	Если Данные = Неопределено Тогда
		Возврат Справочники.JIRA_ТипыСвязейЗадач.ПустаяСсылка();
	КонецЕсли;
	
	НайденнаяСсылка = Справочники.JIRA_ТипыСвязейЗадач.НайтиПоКоду(Данные["id"]);
	Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		НовыйОбъект = Справочники.JIRA_ТипыСвязейЗадач.СоздатьЭлемент();
		НовыйОбъект.Код = 			Данные["id"];
		НовыйОбъект.Наименование = 	Данные["name"];
		НовыйОбъект.Внутри = 	Данные["inward"];
		НовыйОбъект.Снаружи = 	Данные["outward"];
		
		НовыйОбъект.Записать();
		
		НайденнаяСсылка = НовыйОбъект.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции
